<template>
    <v-div>
        <h1>Заказы</h1>
        <v-table :headers="Headers" :content="Content" />
    </v-div>
</template>

<script>
import VTable from "@/components/VTable.vue";

export default {
    components: {
        VTable
    },
    data() {
        return {
            Headers: [
                "ID","ИНН","ID Продукта","Количество","Закупочная цена","Дата заключения","Дата доставки","ID Склада","ID Сотрудника"
            ],
            Content: [
                [1,372523715592,1,120,25,'01-05-2022','21-06-2022',2,1],
                [2,211074240439,2,734,20,'02-06-2022','22-06-2022',4,10],
                [3,372523715592,3,424,150,'08-06-2022','29-06-2022',3,10],
                [4,211074240439,5,512,25,'09-06-2022','30-06-2022',2,1],
                [5,789906678634,1,623,25,'11-06-2022','21-06-2022',3,10],
                [6,372523715592,6,634,100,'10-06-2022','19-06-2022',4,1]
            ]
        }
    }
}
</script>

<style>
</style>